turbq/atprog/packs/atmel/SAM4C_DFP/1.0.86/sam4c/atdf/ATSAM4C8C_0.atdf
      <value-group caption="" name="TC_CMR2__TCCLKS">
        <value caption="Clock selected: internal TIMER_CLOCK1 clock signal (from PMC)" name="TIMER_CLOCK1" value="0x0"/>
        <value caption="Clock selected: internal TIMER_CLOCK2 clock signal (from PMC)" name="TIMER_CLOCK2" value="0x1"/>
        <value caption="Clock selected: internal TIMER_CLOCK3 clock signal (from PMC)" name="TIMER_CLOCK3" value="0x2"/>
        <value caption="Clock selected: internal TIMER_CLOCK4 clock signal (from PMC)" name="TIMER_CLOCK4" value="0x3"/>
        <value caption="Clock selected: internal TIMER_CLOCK5 clock signal (from PMC)" name="TIMER_CLOCK5" value="0x4"/>
        <value caption="Clock selected: XC0" name="XC0" value="0x5"/>
        <value caption="Clock selected: XC1" name="XC1" value="0x6"/>
        <value caption="Clock selected: XC2" name="XC2" value="0x7"/>
      </value-group>
      <value-group caption="" name="TC_CMR2__BURST">
        <value caption="The clock is not gated by an external signal." name="NONE" value="0x0"/>
        <value caption="XC0 is ANDed with the selected clock." name="XC0" value="0x1"/>
        <value caption="XC1 is ANDed with the selected clock." name="XC1" value="0x2"/>
        <value caption="XC2 is ANDed with the selected clock." name="XC2" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR2__ETRGEDG">
        <value caption="The clock is not gated by an external signal." name="NONE" value="0x0"/>
        <value caption="Rising edge" name="RISING" value="0x1"/>
        <value caption="Falling edge" name="FALLING" value="0x2"/>
        <value caption="Each edge" name="EDGE" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR2__LDRA">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Rising edge of TIOA" name="RISING" value="0x1"/>
        <value caption="Falling edge of TIOA" name="FALLING" value="0x2"/>
        <value caption="Each edge of TIOA" name="EDGE" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR2__LDRB">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Rising edge of TIOA" name="RISING" value="0x1"/>
        <value caption="Falling edge of TIOA" name="FALLING" value="0x2"/>
        <value caption="Each edge of TIOA" name="EDGE" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_BMR__TC0XC0S">
        <value caption="Signal connected to XC0: TCLK0" name="TCLK0" value="0x0"/>
        <value caption="Signal connected to XC0: TIOA1" name="TIOA1" value="0x2"/>
        <value caption="Signal connected to XC0: TIOA2" name="TIOA2" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_BMR__TC1XC1S">
        <value caption="Signal connected to XC1: TCLK1" name="TCLK1" value="0x0"/>
        <value caption="Signal connected to XC1: TIOA0" name="TIOA0" value="0x2"/>
        <value caption="Signal connected to XC1: TIOA2" name="TIOA2" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_BMR__TC2XC2S">
        <value caption="Signal connected to XC2: TCLK2" name="TCLK2" value="0x0"/>
        <value caption="Signal connected to XC2: TIOA0" name="TIOA0" value="0x2"/>
        <value caption="Signal connected to XC2: TIOA1" name="TIOA1" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_BMR__AUTOC">
        <value caption="The detection and auto-correction function is disabled." name="DISABLED" value="0"/>
        <value caption="The detection and auto-correction function is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="" name="TC_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0." name="PASSWD" value="0x54494D"/>
      </value-group>
    </module>
    <module caption="True Random Number Generator" name="TRNG" version="6334E">
      <register-group name="TRNG">
        <register caption="Control Register" name="TRNG_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Enables the TRNG to provide random values" mask="0x00000001" name="ENABLE"/>
          <bitfield caption="Security Key." mask="0xFFFFFF00" name="KEY" values="TRNG_CR__KEY"/>
        </register>
        <register caption="Interrupt Enable Register" name="TRNG_IER" offset="0x10" rw="W" size="4">
          <bitfield caption="Data Ready Interrupt Enable" mask="0x00000001" name="DATRDY"/>
        </register>
        <register caption="Interrupt Disable Register" name="TRNG_IDR" offset="0x14" rw="W" size="4">
          <bitfield caption="Data Ready Interrupt Disable" mask="0x00000001" name="DATRDY"/>
        </register>
        <register caption="Interrupt Mask Register" name="TRNG_IMR" offset="0x18" rw="R" size="4">
          <bitfield caption="Data Ready Interrupt Mask" mask="0x00000001" name="DATRDY"/>
        </register>
        <register caption="Interrupt Status Register" name="TRNG_ISR" offset="0x1C" rw="R" size="4">
          <bitfield caption="Data Ready" mask="0x00000001" name="DATRDY"/>
        </register>
        <register caption="Output Data Register" name="TRNG_ODATA" offset="0x50" rw="R" size="4">
          <bitfield caption="Output Data" mask="0xFFFFFFFF" name="ODATA"/>
        </register>
      </register-group>
      <value-group caption="" name="TRNG_CR__KEY">
        <value caption="Writing any other value in this field aborts the write operation." name="PASSWD" value="0x524E47"/>
      </value-group>
    </module>
    <module caption="Two-wire Interface" name="TWI" version="6212V">
      <register-group name="TWI">
        <register caption="Control Register" name="TWI_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Send a START Condition" mask="0x00000001" name="START"/>
          <bitfield caption="Send a STOP Condition" mask="0x00000002" name="STOP"/>
          <bitfield caption="TWI Master Mode Enabled" mask="0x00000004" name="MSEN"/>
          <bitfield caption="TWI Master Mode Disabled" mask="0x00000008" name="MSDIS"/>
          <bitfield caption="TWI Slave Mode Enabled" mask="0x00000010" name="SVEN"/>
          <bitfield caption="TWI Slave Mode Disabled" mask="0x00000020" name="SVDIS"/>
          <bitfield caption="SMBus Quick Command" mask="0x00000040" name="QUICK"/>
          <bitfield caption="Software Reset" mask="0x00000080" name="SWRST"/>
        </register>
